#### ShowHiddenLinesValues Enumeration

---

|  |
| --- |
| See Also |

Provides options for display of hidden lines in a given view.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum ShowHiddenLinesValues ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration ShowHiddenLinesValues ``` |

| Visual C++ |
| --- |
| ``` public enum class ShowHiddenLinesValues ``` |

# Members

| Member name | Description |
| --- | --- |
| None | Do not show any hidden lines. |
| ByDiscipline | Show hidden lines according to discipline. |
| All | Show all hidden lines. |

# See Also

Autodesk.Revit.DB Namespace